USER_INTERACTION_ANSWERS = {
    'role_permission_created': 'Не то, чтобы мне до тебя было какое-то дело, но...\nЯ создала роль **{role_name}** для тебя и выдала доступы во все голосовые каналы.\n\nИ кстати, изменить цвет роли ты можешь командой **/change_role_color**',
    
    'url_len_err': '**Baaaka!** Тебе же было сказано - отправь 5 ссылок, ни больше ни меньше!',
    
    'shikimori_url_valid_err': '*Надулась*\n\n**{url}**, вот это похоже на ссылку на персонажа с сайта Shikimori?',
    
    'unique_waifu_err': 'Ты всегда так глупо ведешь себя или только передо мной? Твои вайфу должны быть уникальны! А ты добавляешь одну и ту же вайфу несколько раз...',
    
    'waifu_not_found': 'Персонаж по ссылке {url} не найден на Shikimori. Повтори команду, введя корректные ссылки!',
    
    'shikimori_unknown_message': 'Что-то пошло не так :( Извини... это я напортачила. Надеюсь, ты не сердишься на меня... Попробуй еще раз!',
    
    'greetings': '{current_hour}, {nickname}!\n\nДобро пожаловать на наш сервер!\n\n*Вздыхает* Как бы я не хотела все это говорить, но мой создатель заставляет это делать из раза в раз... Это сервер пожилых виабушников, тут либо смотрят бурятские мультфильмы, либо играют. Ну иногда общаются. *Закатывает глаза* И постоянно деградируют (мне правда нужно говорить об этом каждый раз?).\n\nТак, что же тебе делать в первую очередь? Отправь команду **/grant_permission** в https://discord.com/channels/902208084007583775/1138798963726758008, придумай себе название для роли, которую я тебе выдам и добавь 5 своих любимых Вайфу, используя ссылки с сайта https://shikimori.one/.\n\nПока ты этого не сделаешь, ты не увидишь текстовые и голосовые каналы. Так что давай, не теряй времени, получай права и...\n*Вздыхает* **Irasshaimase!**',
    
    'adding_waifu_err': 'Я случайно заметила, как ты уже отправлял список своих вайфу... Но это только потому что мне было скучно, а не потому что мне важно, понял?!',
    
    'role_already_exists': 'Роль **{role}** уже существует на сервере!',

    'user_not_found': '*Даже не смотрит в твою сторону* Ты хоть правильно вводи никнейм или юзернейм пользователя. А по твоему запросу никто не найден.',
    
    'show_my_waifu_err': 'Ты еще не заполнял(а) список своих вайфу\nВызови команду /grant_permission для заполнения списка.',

    'show_other_waifu_err': '**{username}** еще не заполнял(а) список своих вайфу.',

    'show_bot_waifu': 'Нет, может на сервере есть кто-нибудь с таким же именем, как у меня, я польщена (но в таком случае лучше ник сменить), но мне добавлять вайфу нет смысла. Так что не будь дураком, узнай лучше про вайфу других пользователей!',
    
    'true_love_no_user_err': 'Ой, какой сюрприз! Ты до сих пор не получил права на сервере. Наверное, так и будешь вечным молчуном...',
    
    'true_love_url_err': 'Ты хоть знаешь, что такое "вайфу"? А то, вместо правильной ссылки, ты скинул мне какую-то ерунду...',
    
    'user_waifu_no_connection': 'А ты так и набиваешь оскомину своими запросами! Нет, конечно же, между указанной вайфу и тобой нет никакой связи. И раз ты так недоумеваешь, мне просто интересно понаблюдать за твоей неудачной попыткой.',
    
    'added_true_love': 'Ах, наконец-то ты сделал хоть какой-то шаг вперёд!\n`❤️ TRUE LOVE ❤️` для **{waifu}** добавлен, но это вовсе не значит, что я впечатлена или что-то подобное. Ты просто делаешь то, что должен был сделать.',
    
    'delete_true_love_user_err': 'Мда, ты пытаешься бросить кого-то, хотя еще даже не получил права на сервере?',
    
    'deleted_true_love': '*Смотрит на тебя с отвращением*\n\nВзял и решил бросить кого-то — типичное поведение для таких, как ты.',

    'top_waifu_err': 'Знаешь, я, конечно, не сильно в этом заинтересована, но, кажется, ты пытаешься посмотреть ТОП вайфу. Однако, как-то все пошло не по плану. Скорее всего никто еще не добавлял себе вайфу при помощи команды /grant_permission. Но, наверное, мне не стоит беспокоиться об этом...',

    'role_not_found': 'Роль с именем **{role_name}** не найдена.',

    'role_not_assigned': '*Вздыхает и закатывает глаза*\n\nРоль с именем **{role_name}** не присвоена тебе. Зачем ты пытаешься взаимодействовать с ролью другого пользователя? Дурак...',

    'invalid_hex_code': 'Неверный HEX код цвета. Тебе нужно ввести код формата **#RRGGBB** и обязательно с #, а то вдруг ты дурак и забудешь про хэштег... Дурак...\n\n*Засмущалась, отвернулась*',

    'color_changed': 'Цвет роли **{role_name}** успешно изменен на **{color}**.',

    'permission_error': '*Пренебрежительно* Хм. У меня нет прав вносить изменения для этой роли!',

    'unexpected_error': 'Произошла неожиданная ошибка. Попробуй еще раз позже...',

    'same_role_name': '*Даже не смотрит в твою строну*\nНовое имя роли не может совпадать с текущим именем роли **{role_name}**!',

    'name_changed': 'Название роли **{old_role_name}** успешно изменено на **{new_role_name}**!',

}
