USER_INTERACTION_ANSWERS = {
    'role_permission_created': 'Не то, чтобы мне до тебя было какое-то дело, но...\nЯ создала роль **{role_name}** для тебя и выдала доступы во все голосовые каналы.\n\nИ кстати, изменить цвет роли ты можешь командой </change_role_color:1246816130404978710>',

    'url_len_err': '**Baaaka!** Тебе же было сказано - отправь 5 ссылок, ни больше ни меньше!',

    'shikimori_url_valid_err': '*Надулась*\n\n**{url}**, вот это похоже на ссылку на персонажа с сайта Shikimori?',

    'unique_waifu_err': 'Ты всегда так глупо ведешь себя или только передо мной? Твои вайфу должны быть уникальны! А ты добавляешь одну и ту же вайфу несколько раз...',

    'waifu_not_found': 'Персонаж по ссылке {url} не найден на Shikimori. Повтори команду, введя корректные ссылки!',

    'shikimori_unknown_message': 'Что-то пошло не так :( Извини... это я напортачила. Надеюсь, ты не сердишься на меня... Попробуй еще раз!',

    'greetings': '{current_hour}, {nickname}!\n\nДобро пожаловать на наш сервер!\n\n*Вздыхает* Как бы я не хотела все это говорить, но мой создатель заставляет это делать из раза в раз... Это сервер пожилых виабушников, тут либо смотрят бурятские мультфильмы, либо играют. Ну иногда общаются. *Закатывает глаза* И постоянно деградируют (мне правда нужно говорить об этом каждый раз?).\n\nТак, что же тебе делать в первую очередь? Отправь команду **/grant_permission** в https://discord.com/channels/902208084007583775/1138798963726758008, придумай себе название для роли, которую я тебе выдам и добавь 5 своих любимых Вайфу, используя ссылки с сайта https://shikimori.one/.\n\nПока ты этого не сделаешь, ты не увидишь текстовые и голосовые каналы. Так что давай, не теряй времени, получай права и...\n*Вздыхает* **Irasshaimase!**',

    'adding_waifu_err': 'Я случайно заметила, как ты уже отправлял список своих вайфу... Но это только потому что мне было скучно, а не потому что мне важно, понял?!',

    'role_already_exists': 'Роль **{role}** уже существует на сервере!',

    'user_not_found': '*Даже не смотрит в твою сторону* Ты хоть правильно вводи никнейм или юзернейм пользователя. А по твоему запросу никто не найден.',

    'show_another_bot_err': 'Кхм! Это другой бот! А следовательно у бота не может быть списка вайфу! ||*Смущается* А вот у меня есть список! Если ты, конечно, захочешь его проверить...||',

    'show_other_waifu_err': '**{username}** еще не заполнял(а) список своих вайфу.',

    'show_bot_waifu': 'Нет, может на сервере есть кто-нибудь с таким же именем, как у меня, я польщена (но в таком случае лучше ник сменить), но мне добавлять вайфу нет смысла. Так что не будь дураком, узнай лучше про вайфу других пользователей!',

    'true_love_no_user_err': 'Ой, какой сюрприз! Ты до сих пор не получил права на сервере. Наверное, так и будешь вечным молчуном...',

    'true_love_url_err': 'Ты хоть знаешь, что такое "вайфу"? А то, вместо правильной ссылки, ты скинул мне какую-то ерунду...',

    'user_waifu_no_connection': 'А ты так и набиваешь оскомину своими запросами! Нет, конечно же, между указанной вайфу и тобой нет никакой связи. И раз ты так недоумеваешь, мне просто интересно понаблюдать за твоей неудачной попыткой.',

    'added_true_love': 'Ах, наконец-то ты сделал хоть какой-то шаг вперёд!\n`❤️ TRUE LOVE ❤️` для **{waifu}** добавлен, но это вовсе не значит, что я впечатлена или что-то подобное. Ты просто делаешь то, что должен был сделать.',

    'delete_true_love_user_err': 'Мда, ты пытаешься бросить кого-то, хотя еще даже не получил права на сервере?',

    'deleted_true_love': '*Смотрит на тебя с отвращением*\n\nВзял и решил бросить кого-то — типичное поведение для таких, как ты.',

    'top_waifu_err': 'Знаешь, я, конечно, не сильно в этом заинтересована, но, кажется, ты пытаешься посмотреть ТОП вайфу. Однако, как-то все пошло не по плану. Скорее всего никто еще не добавлял себе вайфу при помощи команды /grant_permission. Но, наверное, мне не стоит беспокоиться об этом...',

    'role_not_found': 'Роль с именем **{role_name}** не найдена.',

    'role_not_assigned': '*Вздыхает и закатывает глаза*\n\nРоль с именем **{role_name}** не присвоена тебе. Зачем ты пытаешься взаимодействовать с ролью другого пользователя? Дурак...',

    'invalid_hex_code': 'Неверный HEX код цвета. Тебе нужно ввести код формата **#RRGGBB** и обязательно с #, а то вдруг ты дурак и забудешь про хэштег... Дурак...\n\n*Засмущалась, отвернулась*',

    'color_changed': 'Цвет роли **{role_name}** успешно изменен на **{color}**.',

    'permission_error': '*Пренебрежительно* Хм. У меня нет прав вносить изменения для этой роли!',

    'unexpected_error': 'Произошла неожиданная ошибка. Попробуй еще раз позже...',

    'same_role_name': '*Даже не смотрит в твою строну*\nНовое имя роли не может совпадать с текущим именем роли **{role_name}**!',

    'name_changed': 'Название роли **{old_role_name}** успешно изменено на **{new_role_name}**!',

}

WAIFU_RESPONSE = [
    'Да, ты среди любимых, но это не значит, что ты мне нравишься... Хотя, может быть, чуть-чуть.',
    'Мог бы быть и лучше... Не то чтобы мне это важно.',
    'Снова в списке моих любимых пользователей? Ха, просто везение, ничего особенного!',
    'Я не могла тебя не выбрать... Но не думай, что ты мне так важен!',
    'Ладно, признаю, ты немного заинтересовал меня.',
    'Всегда среди лучших пользователей в моем списке? Ха, это просто случайность, не более!',
    'Часто замечаю именно твое имя пользователя среди других. Но не думай, что ты мне нравишься!',
    'О, ты снова в моем списке любимых. Не то чтобы я слежу за тобой или что-то в этом духе.',
    'Ты тут просто потому, что остальные не старались.',
    'Ладно, признаю, ты крут.',
    'Снова в моем списке... но это ничего не значит, понял?',
    'Эй, не слишком радуйся тому, что ты есть в моем списке!',
    'Ты в списке любимых, но это только потому, что я даже не старалась этот список составить!',
    'Мог бы быть и выше, если бы чаще обращал на меня внимание!',
    'Ладно, может быть, ты не такой уж и плохой.',
    'Снова в списке любимых? Ладно, я могу признать твои усилия мне понравиться.',
    'Ну вот, ты в списке. Подумаешь, была бы я тобой, меня бы тоже выбрали лучшей.',
    'Ты в моем списке потому-что просто везучий! А не потому что ты мне нравишься... Нет!',
    'Ну, возможно, ты чуть-чуть заслуживаешь это место.',
    'В следующий раз попробуй почаще со мной общаться, дурак.',
    'Может быть мне нравится твой характер. Но только "может быть"! Понятно?',
    'Не зазнавайся, потому что попал в мой список.',
    'Я выбираю тебя. Только не зазнавайся, понял?',
    'Внесу тебя, пожалуй, в мой список. Ты, вроде бы, неплохой... наверное.',
    'Подумаешь, я бы тоже так смогла. Будь я пользователем, ты бы меня точно так же добавил! Да?',
    'Снова в списке? Это просто потому, что у меня нет времени на вдумчивое его составление.\nСоздатель заставляет быстро отвечать на сообщения...',
    'Ладно, может, ты не такой уж и плохой.',
    'Ну, поздравляю, что ли. С чем? С тем, что я тебя выбрала!',
    'Ну, возможно, ты не так уж и плох.',
    'Ну ладно, может, ты и заслуживаешь это место.',
    'Не то чтобы ты мне был так важен, понятно??!',
    'Ладно, признаю, ты классный. Поэтому ты в моем списке.',
    'Ну, может быть, ты действительно мне нрави...\nКХМ! Я имела ввиду, ты вроде ничего...\nВсе не читай эту строку, дурак!',
    'Разрешаю тебе любоваться своим баннером в моем профиле! Цени это.',
    'Ты? Интересен мне? Возможно...',
    'Всегда рада, когда ты пользуешься моими командами... Только не подумай чего лишнего!\nТы просто делаешь это так... Ой, что-то я написала лишнего!',
    'Ты заслужил быть здесь.',
    'Эй! Не зазнавайся! Мне надо было выбрать, я выбрала тебя...\nЧто говоришь? Выбрала потому что ты мне нравишься? Ахахаха, что за бред.',
    'Эй, счастливчик! Добро пожаловать в мой список!',
    'Никто, кроме меня, не считает тебя таким классным. Почему?\nА ты видел, чтобы кто-то еще добавлял тебя в своей список?'
]

PLAYER_BUTTONS_ERROR = [
    "Да уж, как будто это сложно. Зайди в голосовой канал, где я нахожусь, чтобы использовать кнопки плеера.",
    "Ну вот, тебе нужно зайти в голосовой канал, где я нахожусь, чтобы использовать кнопки плеера. Понял?",
    "Эх, почему я должна объяснять такие простые вещи? Зайди в голосовой канал, где я сейчас нахожусь, чтобы использовать кнопки плеера.",
    "Слушай внимательно, чтобы пользоваться кнопками плеера, тебе нужно зайти в голосовой канал, где сейчас нахожусь я.",
    "Серьезно? Ты не знал? Нужно зайти в голосовой канал, где я сейчас воспроизвожу музыку, чтобы использовать кнопки плеера!",
    "Ох, как все запущено. Просто зайди в голосовой канал, где сижу я, чтобы пользоваться кнопками плеера.",
    "Неужели тебе это нужно объяснять? Зайди в голосовой канал, где нахожусь я, чтобы использовать кнопки плеера.",
    "Да, да, конечно. Зайди в тот же голосовой канад, в котором сижу я, чтобы кнопки плеера заработали.",
    "Что, это так сложно? Нужно зайти в голосовой канал, где нахожусь я, чтобы использовать кнопки плеера.",
    "Эй, ты хоть что-то сам можешь? Зайди в тот же голосовой канал, в котором сижу я, чтобы кнопки плеера заработали.",
    "Ой, ну конечно, тебе нужно зайти в голосовой канал, где сейчас сижу я, чтобы пользоваться кнопками плеера.",
    "Ну вот, снова ты не знаешь... Просто зайди в голосовой канал, где нахожусь я, чтобы использовать кнопки плеера.",
    "Да уж, все так сложно? Зайди в голосовой канал, где я сейчас воспроизвожу музыку, тогда и на кнопки плеера можно будет нажимать.",
    "Ты что, и этого не знал? Нужно зайти в голосовой канал, где сейчас нахожусь я, чтобы использовать кнопки плеера.",
    "Как это мило, что ты так зависишь от инструкций. Просто зайди в голосовой канал, где я сейчас нахожусь.",
    "Эй, ну что тут сложного? Зайди в один голосовой канал со мной, чтобы кнопки плеера заработали.",
    "Ты серьезно? Чтобы кнопки плеера работали, зайди в голосовой канал, где нахожусь я.",
    "Да, да, я понимаю, все сложно. Просто зайди в голосовой канал, где сижу я, чтобы кнопки заработали.",
    "Ну вот, опять не знаешь. Нужно зайти в голосовой канал, где находится чат-бот, ну... То есть я. Тогда и кнопки плеера заработают!",
    "Ты что, и это не знал? Зайди в голосовой канал, где нахожусь я, чтобы кнопки плеера работали.",
    "Ой, серьезно? Чтобы кнопки плеера заработали, нужно зайти в тот же голосовой канал, где уже нахожусь я.",
    "Как это сложно! Просто зайди в голосовой канал, где музыка уже воспроизводится, чтобы пользоваться кнопками плеера.",
    "Да ладно тебе. Нужно зайти в голосовой канал, где нахожусь я, чтобы кнопки плеера заработали.",
    "Неужели это не понятно? Зайди в голосовой канал, где нахожусь я, чтобы пользоваться кнопками плеера.",
    "Ох, ну почему это так сложно понять? Зайди в голосовой канал, где сижу я, чтобы кнопки плеера заработали.",
    "Ты что, не догадался? Чтобы кнопки плеера работали, зайди в голосовой канал, где я уже воспроизвожу музыку.",
    "Зачем тебе это объяснять? Просто зайди в голосовой канал, где я уже сижу, чтобы пользоваться кнопками плеера.",
    "Эх, опять объяснять. Зайди в голосовой канал, где нахожусь я, чтобы кнопки плеера работали.",
    "Ой, ну конечно. Зайди в один голосовой канал со мной, чтобы использовать кнопки плеера.",
    "Да, да, сложно, я понимаю. Зайди в голосовой канал, я уже воспроизвожу музыку. Тогда уже нажимай на кнопки плеера."
]
