USER_INTERACTION_ANSWERS = {
    'role_permission_created': 'Не то, чтобы мне до тебя было какое-то дело, но...\nЯ создала роль **{role_name}** для тебя и выдала доступы во все голосовые каналы.',
    
    'url_len_err': '**Baaaka!** Тебе же было сказано - отправь 5 ссылок, ни больше ни меньше!',
    
    'shikimori_url_valid_err': '*Надулась*\n\n**{url}**, вот это похоже на ссылку на персонажа с сайта Shikimori?',
    
    'unique_waifu_err': 'Ты всегда так глупо ведешь себя или только передо мной? Твои вайфу должны быть уникальны! А ты добавляешь одну и ту же вайфу несколько раз...',
    
    'waifu_not_found': 'Персонаж по ссылке {url} не найден на Shikimori. Повтори команду, введя корректные ссылки!',
    
    'shikimori_unknown_message': 'Что-то пошло не так :( Извини... это я напортачила. Надеюсь, ты не сердишься на меня... Попробуй еще раз!',
    
    'greetings': '',
    
    'adding_waifu_err': 'Я случайно заметила, как ты уже отправлял список своих вайфу... Но это только потому что мне было скучно, а не потому что мне важно, понял?!',
    
    'role_already_exists': 'Роль **{role}** уже существует на сервере!',
    
    'show_my_waifu_err': 'Ты еще не заполнял(а) список своих вайфу\nВызови команду /grant_permission для заполнения списка',
    
    'true_love_no_user_err': 'Ой, какой сюрприз! Ты до сих пор не получил права на сервере. Наверное, так и будешь вечным молчуном...',
    
    'true_love_url_err': 'Ты хоть знаешь, что такое "вайфу"? А то, вместо правильной ссылки, ты скинул мне какую-то ерунду...',
    
    'user_waifu_no_connection': 'А ты так и набиваешь оскомину своими запросами! Нет, конечно же, между указанной вайфу и тобой нет никакой связи. И раз ты так недоумеваешь, мне просто интересно понаблюдать за твоей неудачной попыткой.',
    
    'added_true_love': 'Ах, наконец-то ты сделал хоть какой-то шаг вперёд!\n`❤️ TRUE LOVE ❤️` для **{waifu}** добавлен, но это вовсе не значит, что я впечатлена или что-то подобное. Ты просто делаешь то, что должен был сделать.',
    
    'delete_true_love_user_err': 'Мда, ты пытаешься бросить кого-то, хотя еще даже не получил права на сервере?',
    
    'deleted_true_love': '*Смотрит на тебя с отвращением*\n\nВзял и решил бросить кого-то — типичное поведение для таких, как ты.',

    'top_waifu_err': 'Знаешь, я, конечно, не сильно в этом заинтересована, но, кажется, ты пытаешься посмотреть ТОП вайфу. Однако, как-то все пошло не по плану. Скорее всего никто еще не добавлял себе вайфу при помощи команды /grant_permission. Но, наверное, мне не стоит беспокоиться об этом...',

}
